In [1]:
import numpy as np
import pandas as pd

In [5]:
s = pd.Series([1, 2, 3, 4, 5])  #Series一维数组
s = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])
print(s)
s = pd.Series(np.arange(1, 5, 1))
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64
0    1
1    2
2    3
3    4
dtype: int32

In [6]:
df=pd.DataFrame(np.random.randn(5,3),index=["a","b","c","d","e"],columns=["item1","item2","item3"])
df

      item1     item2     item3
a -0.658432  0.176184  0.379244
b -0.478258  1.090135 -0.375927
c -0.185610  0.349842  0.039706
d -0.552489 -1.681538 -0.477441
e  0.719249 -0.683264 -2.128998

In [7]:
df['item1']

a   -0.658432
b   -0.478258
c   -0.185610
d   -0.552489
e    0.719249
Name: item1, dtype: float64

In [8]:
df['item2']

a    0.176184
b    1.090135
c    0.349842
d   -1.681538
e   -0.683264
Name: item2, dtype: float64

In [9]:
df[0:1]

      item1     item2     item3
a -0.658432  0.176184  0.379244

In [10]:
df[1:2]

      item1     item2     item3
b -0.478258  1.090135 -0.375927

In [11]:
df.loc('a')

In [16]:
df.loc['a', ['item1', 'item2']]

item1   -0.658432
item2    0.176184
Name: a, dtype: float64

In [17]:
df.iloc[0, [0, 1]]

item1   -0.658432
item2    0.176184
Name: a, dtype: float64

In [18]:
df.iat[1, 1]

1.090135053237653

In [19]:
df1 = df.reindex(index = ['a', 'b', 'c', 'd'], columns = list(df.columns) + ['item4'])

In [21]:
df1

      item1     item2     item3  item4
a -0.658432  0.176184  0.379244    NaN
b -0.478258  1.090135 -0.375927    NaN
c -0.185610  0.349842  0.039706    NaN
d -0.552489 -1.681538 -0.477441    NaN

In [23]:
df1.iat[0, 3] = 0.99

In [24]:
df1

      item1     item2     item3  item4
a -0.658432  0.176184  0.379244   0.99
b -0.478258  1.090135 -0.375927    NaN
c -0.185610  0.349842  0.039706    NaN
d -0.552489 -1.681538 -0.477441    NaN

In [25]:
df1.dropna(how = 'any')

      item1     item2     item3  item4
a -0.658432  0.176184  0.379244   0.99

In [26]:
df1.fillna(value = 0.1234)

      item1     item2     item3   item4
a -0.658432  0.176184  0.379244  0.9900
b -0.478258  1.090135 -0.375927  0.1234
c -0.185610  0.349842  0.039706  0.1234
d -0.552489 -1.681538 -0.477441  0.1234

In [27]:
df = pd.DataFrame({'a':[1, 2, 3], 'b':[1, 3, 5], 'c':[5,  4, 1], 'd' : [5, 6, 6], 'e' : [1, 7, 8]}, index = ['r1', 'r2', 'r3'])
df

    a  b  c  d  e
r1  1  1  5  5  1
r2  2  3  4  6  7
r3  3  5  1  6  8

In [28]:
df.describe()

         a    b         c         d         e
count  3.0  3.0  3.000000  3.000000  3.000000
mean   2.0  3.0  3.333333  5.666667  5.333333
std    1.0  2.0  2.081666  0.577350  3.785939
min    1.0  1.0  1.000000  5.000000  1.000000
25%    1.5  2.0  2.500000  5.500000  4.000000
50%    2.0  3.0  4.000000  6.000000  7.000000
75%    2.5  4.0  4.500000  6.000000  7.500000
max    3.0  5.0  5.000000  6.000000  8.000000

In [29]:
df.count()

a    3
b    3
c    3
d    3
e    3
dtype: int64

In [30]:
df[df.a>1]

    a  b  c  d  e
r2  2  3  4  6  7
r3  3  5  1  6  8

In [31]:
s = df.loc['r1']

In [32]:
s

a    1
b    1
c    5
d    5
e    1
Name: r1, dtype: int64

In [36]:
df1 = df.append(s, ignore_index = False)

In [37]:
df1

    a  b  c  d  e
r1  1  1  5  5  1
r2  2  3  4  6  7
r3  3  5  1  6  8
r1  1  1  5  5  1

In [38]:
df1 = df.append(s, ignore_index = True)
df1

   a  b  c  d  e
0  1  1  5  5  1
1  2  3  4  6  7
2  3  5  1  6  8
3  1  1  5  5  1

In [39]:
df2=pd.DataFrame(df1.values,index=list(df.index)+["r4"],columns=list(df.columns))

In [40]:
df2

    a  b  c  d  e
r1  1  1  5  5  1
r2  2  3  4  6  7
r3  3  5  1  6  8
r4  1  1  5  5  1